Tekla.Structures.Model.BoltGroup.BoltPlainHoleTypeEnum
The plain hole type.

Tekla.Structures.Model.BoltGroup.BoltPlainHoleTypeEnum.HOLE_TYPE_THROUGH
The through hole type.

Tekla.Structures.Model.BoltGroup.BoltPlainHoleTypeEnum.HOLE_TYPE_BLIND
The blind hole type.